HELLO: PROCEDURE OPTIONS(MAIN);
   DECLARE NAME CHAR(20) VARYING;
   PUT LIST('HELLO FROM THE PL/I IDE!; now press enter and type a name!');
   GET LIST(NAME);
   PUT SKIP LIST('AND HELLO,', NAME);
   return(0);
END HELLO;
