PARMDEMO: PROC(PARMSTR) OPTIONS(MAIN);
   DECLARE PARMSTR CHAR(100) VARYING;
   IF LENGTH(PARMSTR) = 0 THEN
      PUT LIST('NO PARM SUPPLIED');
   ELSE
      PUT LIST('PARM = ', PARMSTR);
END PARMDEMO;
